package verify;

import com.lsj.trans.Dispatch;

public class SmallTest {

	public static void main(String[] args) throws Exception {
		// TODO Auto-generated method stub
		// sss();
		Main.yandexKey = "trnsl.1.1.20170203T170914Z.3aa140986a456c8a.5a30bea15be7883744cf1a6e26867d5e80444960";
		Class.forName("com.lsj.trans.YandexDispatch");
		Class.forName("com.lsj.trans.BingNeuralDispatch");
		// String kk="Календарная зима разменяла вторую декаду, но вела себя как
		// закоренелая лентяйка. Никакого тебе мороза или хотя бы явных холодов,
		// ни единой снежинки и порывов северного ветра. Над Зоной привычно
		// висели низкие серые тучи, накрапывал дождь, иногда в отдельных
		// секторах ветви деревьев и траву покрывал толстый слой инея. Вот,
		// пожалуй, и все. Многочисленные водоемы оставались свободными ото
		// льда, а земля чавкала жирной грязью. То есть особых отличий от осени
		// пока не наблюдалось.\n«День стал короче, – все таки нашел
		// существенное отличие майор Бражников. – А в остальном… сиротская
		// зима, некачественная. То ли дело дома, в Сибири. Там уже месяц, как
		// белым бело. Ну, почти. Не считая городских пейзажей, особенно
		// кузбасских, поблизости от угольных шахт и разрезов. Но даже там
		// подмораживает не по детски. Шутка ли, десятое декабря. Самое время
		// для первой волны настоящих морозов».\nМайор обернулся и жестом
		// приказал своим бойцам рассредоточиться. Позади цепи спецназовцев
		// виднелись серые китовые туши двух вертушек. Сходство дополняли
		// «фонтаны» вращающихся лопастей, которые серебрились над горбатыми
		// спинами винтокрылых машин. Не было только тяжелых вздохов и плеска.
		// Звуков вообще было мало. Гул двигателей и свист рассекаемого
		// лопастями воздуха для этих моделей вертолетов нехарактерны. Как
		// конструкторам удалось добиться такого эффекта, для Бражникова всегда
		// было загадкой, но факт оставался фактом – вертушки считались почти
		// бесшумными, в самый раз для секретных операций. Уходить на базу
		// «борта» не собирались, они просто выполняли приказ не глушить на
		// всякий пожарный случай двигатели. Зона есть Зона, здесь следует быть
		// постоянно начеку. Тем более, прибыв в оперативный квадрат по такой
		// тревожной «вводной».\nМысль об опасности, пропитывающей Зону
		// насквозь, заставила майора в который раз окинуть взглядом
		// окрестности. Раньше в этот район он приходил только в составе пеших
		// групп. Иногда удавалось проехать часть пути на машине, но на юго
		// западной окраине Чернобыля приходилось спешиваться и месить вечную
		// грязь сапогами. Однажды удалось проникнуть в смежный с этим сектором
		// район Лелева по воде, но это был исключительный случай. Почти такой
		// же, как сейчас, когда спецназ рискнул высадиться на берегу бывшего
		// пруда охладителя ЧАЭС в секторе Копачей. Даже при слабом свете
		// хмурого дня, почти в сумерках, на севере была хорошо видна вытяжная
		// труба станции, а в западном направлении, среди потерявших листву, но
		// все равно густых зарослей угадывались холмики над руинами поселка.
		// Большую часть домишек мертвого населенного пункта засыпали землей еще
		// после первой катастрофы, когда безуспешно пытались отстоять зону
		// (тогда еще не с заглавной буквы) в борьбе с радиацией. Тот бой был
		// проигран вчистую и практически сразу, а потому поселок Копачи
		// ликвидаторы похоронили не полностью, сколько успели. До сегодняшнего
		// дня у трассы Чернобыль – Припять, среди вымахавших за неполные три
		// десятилетия деревьев сохранился десяток покосившихся деревянных
		// строений и остовы пары каменных зданий. В одном из них, бывшем
		// детском саду, рейдовые отряды военных частенько устраивали
		// оперативный штаб, и вообще условно он считался центром сектора,
		// своего рода точкой сбора в непредвиденных ситуациях.\nСегодня группа
		// спецназа высадилась далеко от дороги, но и в таком ракурсе Копачи
		// были майору не в новинку. Он сразу засек знакомые ориентиры и
		// определил направление поиска. Строго на север, вдоль берега, порядка
		// трехсот метров. Именно там, по данным разведки, нелегальные торговцы
		// артефактами обустроили временный склад перевалку, поблизости от
		// которого во время зачистки у военных и возникли проблемы. Как сказал
		// оперативный дежурный, предпоследнее сообщение от командира
		// «чистильщиков» не оставляло сомнений – подразделение вышло на цель. А
		// вот следующий рапорт был уже не таким бодрым. Даже больше – сумбурным
		// и невнятным.\n«Кричал, что попали в большую мясорубку, просил
		// вертушки, – вручая листок с коротким предписанием, добавил дежурный.
		// – Смотрите там, осторожно работайте, тоже не вляпайтесь…»\nБражников
		// попытался уточнить, что подразумевал командир «чистильщиков» под
		// словом «мясорубка» и упоминал ли о превосходящих силах противника, но
		// дежурный только пожал плечами. Начштаба МИС, неожиданно явившийся
		// собственной высочайшей персоной к отлету спецназа, ситуацию тоже не
		// прояснил. Лишь повторил просьбу дежурного работать без ухарства и
		// пожелал удачи.\nМайор против такой постановки задачи, в принципе, не
		// возражал. В сложившейся ситуации важнее было прибыть в квадрат
		// максимально быстро, а уж разобраться можно и на месте. Для того и
		// существуют силы быстрого реагирования, чтобы молниеносно отвечать на
		// любые раздражители и утрясать проблемы.\nИ все таки иметь более
		// конкретную информацию до начала операции было бы лучше. Хотя бы
		// свежую сводку об аномальной активности в секторе. Вляпаться в какую
		// нибудь дрянь (хотя бы в самую простую «Карусель» – уже проблема) на
		// подлете или в момент высадки можно было запросто. Вечные сумерки из
		// за низкой облачности и паршивая погода вполне к этому располагали.\nК
		// счастью для группы, вертушки сели успешно, аномалий ни детекторы, ни
		// профессиональное чутье не уловили, а с мутантами в секторе все было
		// вообще прекрасно, то есть никак. С одной стороны, такая стерильная
		// чистота территории радовала, но с другой – настораживала. Во всяком
		// случае, не расслабляла. По собственному опыту Бражников знал, что
		// «чистота» в Зоне – первый признак приближения крупных неприятностей.
		// И чем чище сейчас, тем крупнее проблемы будут чуть позже. Зверье и
		// аномалии полностью исчезали из сектора только в двух случаях: если
		// Зона собиралась закрыть его на консервацию либо если назревало
		// образование другой аномалии, более мощной и крупной, чем все
		// существовавшие здесь «Трамплины», «Воронки» и «Карусели», вместе
		// взятые.\nМайор бросил взгляд на экран детектора. Приборчик пока не
		// улавливал серьезных возмущений аномальной энергии, но это ничего не
		// значило. Электроника работает строго по программам, а их пишут люди.
		// А люди Зону пока до конца не поняли, то есть всего учесть не в
		// состоянии. Оставалось полагаться на чутье, которое подсказывало
		// Бражникову, что проблемы, конечно, назревают, к бабкам не ходи, но
		// время пока есть.\nБражников для комплекта проверил эфир – тишина – и
		// подал знак бойцам. Группа тотчас двинулась в сторону склада.
		// Замаскирован объект был тщательно, со стороны – поросший кустарником
		// холм, каких тут в избытке, однако его выдавали две очевидные вещи:
		// укатанная дорога, ведущая к спрятанным в зарослях основным воротам, и
		// небольшой, но явно рабочий причал у ворот вспомогательных, выходящих
		// на пруд.\nЖирная грязь под ногами мешала двигаться быстро и скрытно,
		// налипая комьями на сапоги и предательски чавкая, но постанывания
		// путающегося в ветвях слабого ветра и мерный плеск холодных волн
		// перекрывали все демаскирующие звуки, а потому приблизиться к складу
		// удалось почти бесшумно. Жаль, что только приблизиться, а не
		// проникнуть в него.\nВ последний момент, когда до ворот оставалось не
		// больше полусотни метров, один из бойцов на левом фланге споткнулся и
		// плюхнулся в грязь на одно колено. Майор обернулся к нарушителю
		// звуковой маскировки и замер, напряженно вглядываясь в полумрак. Нет,
		// с бойцом все было в порядке, он быстро поднялся, но дальше почему то
		// не двинулся. Бражников окинул взглядом участок местности перед
		// застывшим в нерешительности воином. Суть сомнений бойца стала понятна
		// с первого взгляда. Путь ему преградил настоящий завал из человеческих
		// тел. Примерно два десятка мертвецов валялись вповалку, в разных позах
		// на площади в тридцать квадратных метров.\nМайор жестом приказал
		// группе остановиться и медленно приблизился к месту побоища.\nЛюди
		// погибли недавно, над некоторыми телами можно было заметить легкий
		// парок. Он курился из рваных ран, скорее всего, оставленных зверьем,
		// но Бражников почему то был уверен, что мутанты прискакали уже на
		// готовенькое. Факт доказывало хотя бы то, что падальщики испугались и
		// дали деру, заслышав приближение новой группы людей. Настоящие хищники
		// добычу не бросили бы.\nМайор присел рядом с ближайшим трупом. На нем,
		// в отличие от других, не было видимых повреждений. Бражников попытался
		// нащупать пульс, но не нашел. Однако кожа была податливой и еще
		// теплой. Получалось, что спецназ опоздал на считаные минуты. Это было
		// обидно. В особенности потому, что все погибшие, как один, были
		// своими.\nМайор поднялся и вновь окинул взглядом местность. Еще одно
		// скопление трупов он заметил метрах в двадцати к югу, а о третьем ему
		// просигналил боец с правого фланга. До Бражникова вдруг дошло, что
		// тела лежат на равном удалении от того места, где майор стоял минуту
		// назад, в тот момент, когда споткнулся левофланговый. Бражников
		// вернулся на свою прежнюю позицию и увидел с нее еще несколько
		// тел.\nЭти погибшие тоже были вооружены, но одеты не в камуфляж,
		// скорее всего – охранники склада. И лежали не навалом, а образуя
		// отчетливый полукруг. Майор повернулся на половину оборота, затем еще
		// раз, завершая панорамный обзор, и перевел взгляд себе под ноги.
		// Складывалось впечатление, что все эти люди погибли в один миг от
		// какого то взрыва, прогремевшего на том самом месте, где сейчас стоял
		// Бражников. Однако ни воронки, ни других признаков взрыва командир
		// спецназа не находил, как ни старался.\n«Аномалия? – подумал
		// Бражников, наткнувшись, наконец, на какое то подозрительное темное
		// пятно в двух шагах от себя. Оно лишь на йоту, но все же отличалось
		// насыщенностью цвета от окружающей грязи. – Если аномалия, то ранее
		// неизвестная. Интересно было бы узнать, артефакты она
		// производит?»\nБражников еще раз взглянул на черное пятно посреди
		// условного круга и почувствовал легкий укол интуиции. Пятно
		// увеличилось. Не намного, но все таки. Что бы это ни было – искомый
		// артефакт производства неизвестной аномалии, остаточные явления или же
		// очередная фаза аномального процесса, задерживаться в опасной зоне не
		// следовало.\nМайор дал отмашку, и группа двинулась к воротам.
		// Задерживаться не следовало, это верно, а вот выполнить боевую задачу
		// следовало непременно. Приказа спасти выживших никто не отменял.
		// Возможно, все «чистильщики» лежали здесь, по окружности странной,
		// помеченной черным пятном поляны, но это была лишь теорема, которую
		// требовалось доказать.\nВорота склада были приоткрыты, а внутри, кроме
		// вездесущих крыс, не обнаружилось ни одной живой души. Группа быстро
		// прошла по всей длине помещения, проверяя каждый закоулок и заглядывая
		// под каждый из десятков заваленных товаром стеллажей, но никого так и
		// не обнаружила. В задней стене склада нашлись три распахнутые двери.
		// Центральная, самая широкая, двустворчатая, открывалась в коридор,
		// который заканчивался у запасных ворот, две другие вели на лестницы.
		// Левая – на лестницу вверх, а та, в свою очередь, – в небольшой
		// складской офис, правая – вниз. Как и предполагал Бражников,
		// «временный» склад оказался очень даже основательным, с тремя
		// подземными уровнями. На «грунтовом» хранились продукты и вещи, а на
		// первом от поверхности обнаружился небольшой арсенал. И тоже никого,
		// ни охраны, ни грузчиков. На «минус втором» в рабочем беспорядке
		// хранились ящики с артефактами, а на третьем было вообще пусто, одни
		// стеллажи.\nПосле более тщательного обследования Бражников нашел там
		// следы недавнего ремонта. Видимо, этот уровень собирались загрузить
		// товаром со дня на день, но не успели. Зато здесь явно успели
		// повоевать, и очень даже серьезно. В дальнем углу помещения,
		// неподалеку от приоткрытой решетки над канализационным коллектором,
		// валялись три «досуха выпитых» тела и шесть нечеловеческих трупов:
		// контролер и пять кровососов. Учитывая видовые особенности этих
		// мутантов, было странно видеть их рядом даже мертвыми, но факт, как
		// говорится, имел место, и никуда от него не деться. Все мутанты были
		// убиты в одной потасовке – майор наклонился и поднял одну из множества
		// валяющихся поблизости гильз – и из одного вида оружия. Судя по
		// расположению гильз, стреляли четыре или пять стволов, и все
		// специальные, «Вал» или «Винторез».\n«Чистильщики» заслали спецгруппу
		// через коллектор? Возможно. Только где эти специалисты? Трое «сухих»?
		// Нет, сначала погибли они, а уж после мутанты. А у ворот лежат бойцы с
		// обычным оружием. Не могли же спецы уйти через коллектор, как и
		// пришли? Хотя почему не могли? Если перед основными воротами
		// разбушевалась серьезная аномалия, могли отойти и запасным
		// маршрутом».\nБражников встал на колени и заглянул в коллектор.
		// Подсветка ПНВ позволяла рассмотреть тоннель только на несколько
		// метров, фактически – на вытянутую руку от решетки. Чтобы проверить
		// новую версию, требовалось спуститься в тоннель. Майору не хотелось
		// усложнять жизнь себе и подчиненным, и он решил ограничиться
		// сигнальным «файром». Он зажег факел и, свесившись в просвет тоннеля,
		// зашвырнул его как можно дальше.\nКроме шипения «файра» никаких звуков
		// из тоннеля не донеслось. Даже крысы не зашуршали. Это означало, что
		// если бойцы и ушли этим путем, то сделали это достаточно давно и
		// наверняка теперь уже где то выбрались на поверхность. Успокоив себя
		// таким выводом, Бражников поднялся с колен и жестом приказал своим
		// бойцам двигаться в обратном направлении.\nНа нелегальном складе под
		// Копачами спасать было некого. Факт.\nБражников покинул мрачный склад
		// бункер последним, будто капитан тонущего корабля. Отдаленное сходство
		// подкреплялось, с одной стороны, близостью обширной акватории пруда
		// охладителя, а с другой… лениво колышущейся, как нефтяное пятно,
		// огромной и неестественно круглой лужей перед воротами складской
		// территории. Майор не сразу сообразил, откуда тут вдруг взялось
		// столько пролитой нефти, но зато мгновенно понял, что наступать в эту
		// странную лужу не стоит. Он поравнялся с переминающимися у ворот
		// бойцами и пошарил в кармане. Лучший друг сталкера, да и любого
		// другого ходока в Зону, – болт нашелся сразу. Бражников закинул его
		// почти на середину лужи, с минуту понаблюдал, как над местом падения
		// вздувается и лопается радужный пузырь, а затем поднял тоскливый
		// взгляд к небу, немного просветлевшему под натиском усилившегося
		// ветра. Было неизвестно, зальется ли черная гадость внутрь склада, но
		// планировать дальнейшие действия следовало, исходя из худшего
		// сценария. Впрочем, планировать тут было нечего. Путь отхода оставался
		// один, не считая коллектора – через запасные ворота. Как и прежде, не
		// произнося ни слова, Бражников указал на дальний конец
		// склада.\nПричал, слава богу, был свободен от аномалий. Бойцы в темпе
		// спустились на берег, прошли по урезу воды до небольшого, заваленного
		// мусором пляжика и взяли курс на вертушки.\nМайор по привычке замкнул
		// колонну, более того, даже немного отстал от группы. Если честно,
		// уходить с пустыми руками ему не хотелось. Понятно, что никакой вины
		// он за собой не чувствовал. Спецназ прилетел максимально быстро,
		// перекрыв все нормативы, и будь здесь обычная заварушка, хотя бы
		// половину «чистильщиков» спасти было реально. Но… в Зоне обычным
		// является как раз все необычное. Успеть на выручку людям, попавшим в
		// аномалию, редко удается, даже будучи от них в сотне метров, а что уж
		// говорить о получасе лета? Так что дело было не в чувстве вины, а в
		// качественном отношении к работе. Формально от Бражникова требовалось
		// выполнить приказ и убраться восвояси, а если миссия невыполнима, то
		// просто убраться, без лишних телодвижений. Но Бражников, как офицер
		// думающий и любознательный, не мог себе позволить такой
		// прямолинейности. Да и не приветствовалась она в отряде специального
		// назначения. Особенно после того, как отряд возглавил бывший военный
		// проводник, а ныне полковник Бибик. Согласно его неофициальному
		// приказу, каждый боец, а уж тем более командир группы, встретившись с
		// новой аномалией, был просто обязан увидеть и запомнить как можно
		// больше. А еще лучше – добыть что нибудь с нею связанное: артефакт или
		// хотя бы улики, ее характеризующие. Бражников с таким подходом к
		// службе был полностью согласен, но в данном конкретном случае и с
		// артефактами, и с уликами возникла напряженка. Зачерпнуть «нефти» из
		// черного пятна вряд ли реально, а других «вещдоков» майор поблизости
		// не наблюдал.\nПервые бойцы уже начали грузиться в вертушки, а
		// Бражников все еще находился на полпути от пруда до вертолетов,
		// поскольку не удержался от соблазна и немного принял вправо, чтобы
		// напоследок еще раз взглянуть на черное пятно. Получилось так, что к
		// воротам склада он шел новой тропинкой, на которой неожиданно
		// обнаружилось еще несколько трупов. На этот раз сомнений не было,
		// бойцы убиты из огнестрельного оружия. Все погибшие неплохо
		// экипированы и вооружены, но, судя по количеству гильз вокруг, погибли
		// в неравном бою довольно быстро. Майор склонился и рассмотрел
		// повнимательнее один труп. На рукаве шеврон группировки «Долг», оружие
		// специальное, ПНВ, изолирующая маска… явно диверсант или
		// разведчик.\nБражников выпрямился и озадаченно потер висок. Тела
		// долговцев лежали так, будто они отстреливались от кого то, пришедшего
		// со стороны Копачей. То есть военные были у них в тылу. Этот факт
		// окончательно запутывал все следы и покрывал картину произошедшего
		// толстым слоем темной субстанции. Например, такой, какая плескалась в
		// неестественно круглой луже перед воротами склада.\nМайор развернулся
		// и потопал по тропе дальше. «Нефтяной разлив» был пока на месте, но,
		// похоже, перестал расти вширь. Бражников еще разок прощупал этот
		// «откат аномалии» болтом, снова пронаблюдал за вздувшимся пузырем и,
		// наконец, сдался. Ни выживших, ни артефактов, ни улик привезти из
		// рейда не светило, одни впечатления.\n«Значит, так тому и
		// быть».\nБражников встряхнулся и потрусил к ближайшему
		// «борту».\nДобежать ему удалось только до края поляны, где
		// приземлились вертушки. Здесь уже ощущался сильный ветер, поднятый
		// лопастями летающих машин, и поначалу Бражников не обратил на резкий
		// порыв особого внимания. Однако через два шага он был вынужден
		// остановиться, поскольку ветер вдруг усилился настолько, что
		// преодолеть его натиск стало невозможно.\nМайор пригнулся и опустил
		// бронестекло шлема. Это помогло немного снизить уровень шума, теперь
		// от жуткого воя не закладывало уши, но и только. Бражников под
		// натиском ветра попятился, запнулся о кочку и уселся прямо в грязь.
		// Попасть в такой ураган на ровном месте ему не доводилось никогда.\n«И
		// ведь ни с чего! Тихо ведь было, почти полный штиль, и вдруг на тебе,
		// получи. Опять аномалия? А не перебор? Третий раз на одном квадратном
		// километре в течение одного часа. Что же тут творится то на самом
		// деле?!»\nПаники не было. Майору случалось попадать и не в такие
		// переделки. А вот ощущение беспомощности – ветер буквально вжимал в
		// грязь, не позволяя даже пошевелиться – Бражникову категорически не
		// нравилось. Роль стороннего наблюдателя всегда его тяготила. Пока
		// вроде бы ничего страшного не происходило, и майор мог спокойно
		// пережидать катаклизм, лежа между кочками, словно уж, объевшийся
		// лягушек. Ребята, насколько он мог рассмотреть за тучей поднятых
		// ураганом мокрых листьев и веток, были в порядке. Почти все уже
		// погрузились в вертушки и теперь беспокойно выглядывали, пытаясь
		// высмотреть командира. Но эта неравномерность распределения
		// неприятностей майора и тревожила. Складывалось впечатление, что
		// ураган бушует исключительно над головой у Бражникова, а в каких то
		// ста метрах к востоку стоит все тот же мертвый штиль.\n«Аномалия
		// аномалией… но совесть то где?»\nМайор почувствовал, что настырный
		// ветрище силится поднять добычу и унести по воздуху за тридевять
		// земель, как колдун Черномор. Бражников вцепился в жухлую траву и
		// попытался прижаться к земле еще плотнее. Чтобы окончательно лишить
		// ураган шансов, майор даже пожертвовал чистотой бронестекла и, пригнув
		// голову пониже, буквально ударил лицом (точнее забралом шлема) в
		// грязь. Ветер нехотя отступил. Не сразу, но все таки ослабил свой
		// безумный натиск, а вскоре и вовсе стих, будто его и не было.\nМайор
		// поднял голову, попытался протереть стекло, но только размазал грязь.
		// Пришлось забрало поднять. Сделав это, Бражников понял две вещи: что
		// предчувствия его не обманули и что все произошедшее в этом гиблом
		// местечке было разминкой, самое худшее маячило впереди. Вернее –
		// вокруг.\nАномальный ветер вовсе не утих. Просто теперь он дул не с
		// востока и не с какого то другого направления, а водил хоровод, причем
		// конкретно вокруг Бражникова. Майор, конечно, не обольщался, вряд ли
		// аномалия плясала свою джигу специально для него, просто так уж
		// сложилось, что сегодня Бражникову суждено было оказываться каждый раз
		// в центре событий. Сначала в центре странного «круга мертвых», теперь
		// вот в центре неправильного торнадо. Причем новый круг был примерно
		// того же диаметра, что и прежний – метров тридцать сорок.\nМайор
		// оглянулся. Вихрь больше не играл листвой и ломаными сучьями. Теперь
		// он выстраивал нечто вроде полупрозрачной стены из мельчайших водяных
		// капель и жидкой грязи, только стена эта была не серой или бурой, а
		// красноватой. Бражников в очередной раз оценил силу разбушевавшейся
		// стихии и невольно поежился. Шоу впечатляло, что и говорить. Майору
		// вдруг захотелось подойти к колышущейся стене поближе. Он сделал шаг,
		// но тут кто то тронул его за плечо.\nМайор резко обернулся. Позади
		// стоял перемазанный грязью не хуже него самого человек в униформе,
		// предположительно, наемника. Точно не определить, слишком уж грязным
		// был этот человек. А вот фильтрующая маска на лице у парня оставалась
		// относительно чистой.\n«Грамотный ходок, – сделал вывод майор. – Как
		// же я сразу его не заметил? Где он прятался? И кого он мне напоминает?
		// Знакомый, что ли? Не понять, одни глаза видны, да и то условно, даже
		// цвет не определить».\nЗа тонированным стеклом разглядеть глаза
		// незнакомца действительно было трудно, и все же Бражникову показалось,
		// что этого человека он уже встречал. Да еще этот жест… незнакомец
		// хлопнул майора по плечу как то уж очень по свойски. Логично бы просто
		// спросить «Ты кто?», но сквозь вой ветра расслышать хоть какие то
		// слова было нереально. Ветер быстро набирал обороты и ревел уже громче
		// реактивного лайнера на взлете. Попробуйте поговорить, стоя в тридцати
		// метрах от посадочной полосы. Оставался язык жестов.\nБражников кивнул
		// и вопросительно уставился на человека.\nТот указал на грязевую стену,
		// отрицательно качнул головой и будто бы поманил стену к себе.\nМайор в
		// очередной раз оглянулся по сторонам и понял скрытый смысл пантомимы.
		// Кольцо безумного вихря медленно сжималось. И снова возникла
		// ассоциация с черным пятном у ворот склада. Движение аномалии в данном
		// случае было противоположно направленным, но скорость была той же.
		// Бражников невольно сдал назад, туда, где, по ощущениям, находился
		// центр очерченного вихрем круга. Незнакомец вновь отрицательно качнул
		// головой и деликатно потеснил майора. По его мнению, центр занимать
		// никак нельзя. Бражников вскоре понял почему.\nКогда вихрь сжал воющее
		// кольцо до диаметра всего то десяти метров, точно в центре круга,
		// сантиметрах в тридцати от земли, сверкнула яркая алая вспышка, и в
		// грязь упал буквально ниоткуда взявшийся артефакт. Размером с кулак,
		// он сильно смахивал на небрежно обработанный бриллиант не самой чистой
		// воды – с явным багровым отливом.\nВ отличие от «нефтяных луж» и
		// «кольцевых вихрей», это порождение Зоны было майору знакомо. Он видел
		// такие артефакты во время недавней экскурсии в военную лабораторию.
		// Ученые утверждали, что это самый редкий и дорогой – рыночная цена до
		// миллиона евро! – артефакт, производимый ни много ни мало самим
		// «Черным Ангелом», аномалией, слабо изученной и крайне опасной, к тому
		// же появляющейся исключительно в центре Зоны. То есть там, куда смеют
		// забираться от силы три человека из нескольких десятков тысяч
		// обитателей Зоны и Приграничья.\nНо сомнительное происхождение и
		// завиральная цена артефакта были не самыми сильными шутками в
		// отношении красноватого куска плавленого стекла. Самыми смешными были
		// слухи, что «Джокер», как незатейливо окрестили артефакт сталкеры,
		// дает абсолютную защиту от всех напастей, начиная с радиации,
		// заканчивая любой аномалией, включая материнскую, то есть самого
		// «Черного Ангела», а еще позволяет управлять мутантами и залечивает
		// даже тяжелые раны. Панацея, одним словом. Плюс волшебная флейта и
		// броня принца Джулиана.\nБражников в откровенные бредни о
		// суперартефакте не верил, а потому и не удивился, увидев, что «Джокер»
		// в игре, но «сдает» его вовсе не «Ангел», а всего то относительно
		// безобидный аномальный вихрь. Собственно, поэтому майор даже и не
		// повел бровью, когда артефакт быстро поднял и сунул в карман
		// расторопный незнакомец. Гораздо больше, чем сомнительный артефакт,
		// майора волновала оперативная обстановка. Была она, мягко говоря,
		// хреновой и становилась все хуже с каждой секундой. Попавшие в ловушку
		// люди стояли плечом к плечу, и скоро им предстояло решить, встанут они
		// спиной к спине или же обнимутся, как бы слившись в последнем танце.
		// Воющий на все голоса круг сжался до минимума.\n«А ведь летящая с
		// такой скоростью грязь может обточить не хуже пескоструйной машины.
		// Отшлифует нас до костей, факт. Черт возьми, угораздило
		// вляпаться!»\nНеизвестно, о чем подумал вставший за спиной у майора
		// человек, но, похоже, его занимали другие проблемы. Или те же, но в
		// ином ракурсе. Он вдруг вынул из кармана припрятанный артефакт и сунул
		// его в руку майор А. Бражников удивленно взглянул на человека. Тот
		// жестом пояснил: «Прорываемся, ты первый». Майор усмехнулся и
		// попытался вернуть «Джокера», но незнакомец заблокировал его руку и
		// уверенно кивнул. Было странно, но Бражников ему почему то поверил.
		// Придумать другой способ уцелеть все равно не светило, так почему бы
		// не положиться на опыт товарища по несчастью? Он, похоже, знал, о чем
		// толкует, вернее жестикулирует. Почему он уступил артефакт майору? Об
		// этом тоже некогда было раздумывать. Значит, так надо.\nНезнакомец как
		// бы подтвердил вывод майора, новым жестом обозначив последний пункт
		// договора: «Прорвемся – вернешь». Бражников кивнул, закрыл забрало и
		// приготовился к заведомо проигранной схватке. Прыгать с отчаянным
		// криком в ревущую стену не пришлось. Вихрь сам сомкнул тяжелые объятия
		// и приготовился затачивать «под карандаш» угодивших в его
		// «пескоструйку» людей. Незнакомец вдруг снова вынул что то из кармана,
		// вытянул руку перед собой, шагнул вперед и попытался встать перед
		// майором, будто бы прикрывая его собой, но покачнулся и завалился
		// назад, на руки Бражникову…\n…Первая мысль была простой и ясной:
		// «Жив!» Майор лежал на спине все в той же холодной грязи, но вокруг
		// него больше не выл ураган, а руки, ноги, голова были на месте, и
		// вовсе не обточены до костей. И вообще самочувствие было нормальным.
		// Секундой позже медленно, но верно пришла следующая мысль: «Что жив
		// хорошо, но лучше не разлеживаться». Бражников осторожно сел и поднял
		// «забрало». Прямо по курсу возвышался метровый бруствер, на котором
		// спиной к майору сидел незнакомец.\n«Прорвались?» Майор бегло осмотрел
		// свою униформу. Все было на месте. «Пескоструйка» почти ничего не
		// повредила. Незнакомец, по крайней мере со спины, тоже выглядел вроде
		// бы нормально.\n«Может, привиделось?»\nНад бруствером мелькнули тени
		// приближающихся людей. Бражников не слышал их шагов, в ушах до сих пор
		// шумело, но ощущал вибрацию почвы. Похоже, на выручку спешили все,
		// включая пилотов вертушек. Майор встал и шагнул к сидящему человеку,
		// но вдруг замер на месте. Причиной тому были лица спецназовцев,
		// подбежавших к вырвавшимся из аномалии «напарникам». Точнее, выражения
		// этих самых лиц. Повидавшие немало и в Зоне, и за ее пределами спецы
		// встали как вкопанные и вытаращились на сидящего незнакомца, будто
		// увидели ожившее привидение. Во взглядах ребят читалась смесь
		// недоверия и легкого испуга. Они будто бы не могли поверить, что
		// человек в таком состоянии способен сидеть как живой и мерно
		// покачиваться, словно баюкая сковавшую тело боль. Бражников обошел
		// незнакомца по кругу и присоединился к столпившимся в нерешительности
		// бойцам.\nВидеть такое действительно приходилось нечасто. В отличие от
		// нетронутых «пескоструйкой» спины и затылка, лицо, руки и грудь
		// человека пострадали очень и очень серьезно. Не помогли ни кевларовый
		// боевой костюм, ни бронежилет, ни шлем, ни маска. Более менее уцелела
		// нижняя часть тела (у Бражникова мелькнула «фрейдистская» мысль:
		// «Между поясом и коленками все цело, и то хорошо»), а вот лицо, грудь
		// и руки превратились в огромные раны, начисто лишенные кожи. Под
		// белесыми фасциями подрагивали мышцы, белели оголенные кости, а
		// уцелевшие сосуды тяжело пульсировали. Но самым жутким был взгляд
		// человека. Он смотрел в одну точку лишившимися век глазами и,
		// казалось, удивлялся тому, что до сих пор жив. В сочетании с зияющим
		// провалом носа и оскалом не прикрытых губами челюстей взгляд живого
		// мертвеца был жутким вдвойне.\n– Чего встали, подвиньтесь! – К
		// брустверу протолкнулся врач группы. – Носилки из вертушки тащите!
		// Господин майор, вы в порядке?\n– А? – Бражников перевел взгляд на
		// медика. – Я… нормально. Как думаешь, довезем?\n– Тяжелый случай, но
		// шанс есть. – Доктор присел и пристроил на коленях сумку с медицинской
		// укладкой. – Если не загнется по пути от болевого шока, может и
		// выкарабкаться. Надо уколоть поскорее, а дальше…\nМедик пожал
		// плечами.\n– Ну так коли! – Бражников оглянулся и окинул взглядом
		// полянку, на которой несколько минут назад едва не погиб. Или едва не
		// превратился в такой вот живой скелет, что вряд ли лучше.\nБруствер
		// протянулся вокруг всей поляны и как бы обозначил первоначальные
		// границы вихря. Но майора интересовало не это. Его волновало место,
		// где появился артефакт. Нет, не то чтобы реально волновало, просто…
		// очнулась интуиция. И не напрасно. Точно в центре круга отчетливо
		// темнело «нефтяное» пятно. Пока размером с блюдце.\nМайор снова
		// развернулся к подчиненным и жестом приказал
		// поторапливаться.\n«Чистильщиков» убила такая же «пескоструйка», факт.
		// Не обточив, как этого парня, а каким то другим способом, но это была
		// в точности такая же аномалия, как та, что недавно бушевала вокруг
		// майора.\n«Хорошо, что мои ребята сели в вертушку, – мелькнула мысль.
		// – Окажись они ближе, тоже полегли бы неизвестно по какой причине. И
		// „откат“ здесь, похоже, намечается аналогичный тому, что был у ворот
		// склада».\nПерспектива увязнуть для полноты ощущений в «нефтяной луже»
		// Бражникова не грела. На сегодня персональный лимит острых ощущений он
		// исчерпал.\nКогда группа вновь разместилась в вертушках, майор
		// запрыгнул на борт второй, «санитарной», машины и уселся рядом с
		// незнакомцем. Наложенные врачом повязки почти сразу промокли, и теперь
		// его неизвестный спаситель выглядел, как пропитанная кровью
		// мумия.\nБражников поймал себя на том, что невольно назвал незнакомца
		// спасителем. Рука сама скользнула в карман. Артефакт был на месте. Он
		// был теплым на ощупь и будто бы наэлектризованным, по пальцам
		// разливалось легкое покалывание. Майор достал вещицу и повертел перед
		// глазами. На вид елочная игрушка, а не артефакт. Но если не он, тогда
		// что помогло уцелеть в «пескоструйке»?\nБоковым зрением Бражников
		// уловил взгляд доктора.\n– Что?\n– Ничего. – Медик кивком указал на
		// артефакт. – Если ученые не врут, ценная вещь. Пострадавшему эта штука
		// пригодилась бы.\n– Вы верите, что этот артефакт… всемогущ?\n– Не
		// знаю, их пока мало, не изучены как следует, но дыма без огня не
		// бывает. Вот вы, например, выбрались без единой царапины. Не случайно
		// же?\n– Не случайно. – Бражников осторожно положил артефакт на
		// носилки, рядом с головой пострадавшего.\n– Лучше сюда, чтоб не
		// скатился. – Врач деловито перепрятал вещицу раненому под мышку. –
		// Теперь точно довезем. И вообще.\n– Вы так верите в силу артефактов,
		// доктор? – Майор взглянул на медика исподлобья. – Медицина – это ведь
		// наука, а Зона, мутанты, аномалии, артефакты – это почти мистика…
		// разве они сочетаются?\n– Мистика – все, что мы не можем понять. –
		// Доктор опять пожал плечами. – Для меня, например, математика – чистая
		// мистика. Что ж она теперь, не наука? Вот с Зоной и ее продуктами та
		// же петрушка… Я по команде передам, что этот «Джокер» ваш. Выздоровеет
		// парень, доктора вам его вернут.\n– Не мой, его. Но по команде
		// передайте. Для надежности, чтобы не спер кто нибудь… в порядке
		// мистики.\n– Могут. – Врач кивнул. – В Дымере могут.\n– Отставить
		// Дымер. – Майор отрицательно покачал головой. – К нам отвезем, в
		// госпиталь.\n– Пациент гражданский, – засомневался медик, – не
		// положено.\n– Это приказ, – твердо сказал Бражников. – С госпитальным
		// начальством я улажу. И еще, доктор… возьмете троих ребят и
		// организуете круглосуточную охрану.\n– В госпитале? Там своей охраны
		// полно.\n– Я понимаю, что вы военный только формально, капитан
		// медслужбы Фомин, – Бражников снисходительно похлопал медика по плечу,
		// – но… будете обсуждать приказы, дам в лоб, ясно?\n– Ясно… то есть так
		// точно. – Фомин обреченно вздохнул. – Артефакт стеречь или
		// больного?\n– Вместе. Вы же сказали, без «Джокера» он не вытянет. Но
		// больного в первую очередь. Не нравится мне вся эта картина маслом,
		// Фомин. Не нравится.\nБражников, как бы подчеркивая, что опасения
		// серьезны, заглянул в иллюминатор.\n– Что то я не понял, почему не
		// взлетаем?\nВопрос майором был задан негромко, и пилоты на него не
		// ответили, зато «ответ» в виде небольшой ракеты, выпущенной из «ПЗРК»,
		// прилетел из ближайшей лесополосы. Повезло Бражникову и Фомину лишь в
		// том, что ракета предназначалась другому борту. Дальше события вовсе
		// сорвались с привязи и помчались галопом. Майор отпрянул от стекла и
		// схватил Фомина за рукав.\n– Держись!\nВертушку в тот же миг ощутимо
		// тряхнуло. Доктор не успел вцепиться во что нибудь вроде поручня и
		// завалился на раненого. Бражников тем временем прыгнул к двери и
		// сдвинул ее в сторону.\n– Прыгаем!\nФомин был, конечно, «полувоенным»,
		// но в критических ситуациях соображал ничуть не медленнее спецназовца.
		// Он ухватил носилки с раненым и резко перевернул. Получилось довольно
		// удачно. Спрыгнувший на землю майор поймал вывалившегося из вертушки
		// раненого и завалился на спину. Пациент оказался довольно увесистым.
		// Доктор выкинул носилки и тоже выпрыгнул. Вторая ракета не заставила
		// себя ждать и ударила в хвост «санитарной» вертушке. Машина по
		// непонятной причине взревела «бесшумными» до сих пор двигателями и
		// начала зарываться носом в землю, одновременно разворачиваясь вокруг
		// вертикальной оси по часовой стрелке. Бражников на миг представил, как
		// тяжелый серый бок вертолета подминает замешкавшихся людей, но
		// картинка не задержалась в воображении. Было не до фантазий. Майор
		// ухватил раненого за плечи и потащил подальше от рокочущей и утюжащей
		// землю вертушки. Фомин тоже быстро покинул опасную зону и не с пустыми
		// руками, он притащил носилки.\n– Прыгайте! – обернувшись, крикнул
		// майор пилотам.\nВертолетчики и без команды уже почти выбрались из
		// гибнущей машины, но в этот момент в двигатели ударила еще одна
		// ракета, и вертушка, вспыхнув, осела, и начала разваливаться на куски.
		// Взрывная волна слегка приподняла, а затем крепко хрястнула троих
		// выживших о землю. Бражников остался в сознании, и вообще не потерял
		// контроль ни на миг, но клацнул зубами от всей души, тоже мало
		// приятного. Впрочем, крепче всех досталось раненому. «Джокер» по
		// прежнему был при нем, пульс вроде бы прощупывался, но вряд ли новая
		// порция тумаков пошла бедняге на пользу. Фомин отделался не так легко,
		// как майор, обломком какой то детали вертолета ему зацепило плечо,
		// однако доктор был боеспособен и даже трезво, без паники мыслил.\n– На
		// склад надо, в поле пропадем!\n– Согласен. – Бражников указал на
		// перелесок. – Оттуда били, значит, нам в другую сторону. Надо
		// спуститься к воде. Там встаем, кладем раненого на носилки и ходу
		// вдоль берега. Войдем в склад через ворота на причале. Основные
		// блокированы аномалией.\n– Все понял. Поползли?\n– Вот именно. –
		// Бражников покосился на горящие обломки вертолетов и невесело хмыкнул.
		// – Рожденный ползать летает… не очень. Хватайте за правое плечо, а я
		// за левое. Вперед!..";
		String kk = "Календарная зима разменяла вторую декаду, но вела себя как закоренелая лентяйка.";
		// String kk = "款爷上课喝可乐";
		// System.out.println(StringEscapeUtils.escapeXml(kk));
		// String kk = "I have a pen. I have an apple.";
		System.out.println(Dispatch.Instance("bingn").Trans("ru", "zh", kk));
		// String aString = "sadadwag\nQWQQWEEEQWE";
		//// System.out.println(aString);
		// System.out.println(aString.split("\n")[0]);
		// System.out.println(aString.split("\n")[1]);
		// System.out.println("(?:[()\"']?\\$\\$ACT[_A-Z0-9]*?\\$\\$[()\"']?|%[a-z]\\[[a-z0-9,]*?\\]•?)");
		System.out.println();
	}

	static void sss() {
		try {
			throw new Exception();
		} catch (Exception e) {
			// TODO: handle exception
			System.out.println("kk");
		}
		System.out.println("ll");
	}

}
